In [1]:
import pandas as pd
import numpy as np

In [ ]:
df = pd.read_csv('train.csv')
df.head()

C:\Users\Dell\AppData\Local\Temp\ipykernel_4940\189615863.py:1: DtypeWarning: Columns (5) have mixed types. Specify dtype option on import or set low_memory=False.
  df = pd.read_csv('train.csv')

In [5]:
df_test = pd.read_csv('test.csv')
df_test.head()

          id        date  store_nbr  item_nbr  onpromotion
0  125497040  2017-08-16          1     96995        False
1  125497041  2017-08-16          1     99197        False
2  125497042  2017-08-16          1    103501        False
3  125497043  2017-08-16          1    103520        False
4  125497044  2017-08-16          1    103665        False

In [6]:
df_holidays = pd.read_csv('holidays_events.csv')
df_holidays.head()

,date,type,locale,locale_name,description,transferred
0,2012-03-02,Holiday,Local,Manta,Fundacion de Manta,False
1,2012-04-01,Holiday,Regional,Cotopaxi,Provincializacion de Cotopaxi,False
2,2012-04-12,Holiday,Local,Cuenca,Fundacion de Cuenca,False
3,2012-04-14,Holiday,Local,Libertad,Cantonizacion de Libertad,False
4,2012-04-21,Holiday,Local,Riobamba,Cantonizacion de Riobamba,False

In [7]:
df_oil = pd.read_csv('oil.csv')
df_oil.head()

         date  dcoilwtico
0  2013-01-01         NaN
1  2013-01-02       93.14
2  2013-01-03       92.97
3  2013-01-04       93.12
4  2013-01-07       93.20

In [8]:
df_items = pd.read_csv('items.csv')
df_items.head()

   item_nbr        family  class  perishable
0     96995     GROCERY I   1093           0
1     99197     GROCERY I   1067           0
2    103501      CLEANING   3008           0
3    103520     GROCERY I   1028           0
4    103665  BREAD/BAKERY   2712           1

In [ ]:
df_stores = pd.read_csv('stores.csv')
df_stores.head()

   store_nbr           city                           state type  cluster
0          1          Quito                       Pichincha    D       13
1          2          Quito                       Pichincha    D       13
2          3          Quito                       Pichincha    D        8
3          4          Quito                       Pichincha    D        9
4          5  Santo Domingo  Santo Domingo de los Tsachilas    D        4

In [22]:
df_stores['type'].unique()

array(['D', 'B', 'C', 'E', 'A'], dtype=object)

In [10]:
df_transactions = pd.read_csv('transactions.csv')
df_transactions.head()

         date  store_nbr  transactions
0  2013-01-01         25           770
1  2013-01-02          1          2111
2  2013-01-02          2          2358
3  2013-01-02          3          3487
4  2013-01-02          4          1922

In [11]:
print(df['store_nbr'].nunique())
print(df['item_nbr'].nunique())
print(df['date'].nunique())

54
4036
1684

In [12]:
print(df_test['store_nbr'].nunique())
print(df_test['item_nbr'].nunique())
print(df_test['date'].nunique())

54
3901
16

In [13]:
print(df.shape)
print(df_holidays.shape)

(125497040, 6)
(350, 6)

In [14]:
# uzeti samo 1 prodavnicu, spojiti sa itemima (samo jedna klasa) i onda raditi samo sa tim, pa zatim prosiriti na ostale prodavnice i ostale proizvode
# raditi posebno sa setovima feature-ova, lag-ovi, holdays, oil
# pokupiti cene sa interneta ili neko stanje za odredjene datume
df_st_13 = df[df['store_nbr'] == 13]
print(df_st_13.shape)

(1736728, 6)

In [15]:
test = df.head(100).merge(df_holidays, on='date', how='left')
test

,id,date,store_nbr,item_nbr,unit_sales,onpromotion,type,locale,locale_name,description,transferred
0,0,2013-01-01,25,103665,7.0,NaN,Holiday,National,Ecuador,Primer dia del ano,False
1,1,2013-01-01,25,105574,1.0,NaN,Holiday,National,Ecuador,Primer dia del ano,False
2,2,2013-01-01,25,105575,2.0,NaN,Holiday,National,Ecuador,Primer dia del ano,False
3,3,2013-01-01,25,108079,1.0,NaN,Holiday,National,Ecuador,Primer dia del ano,False
4,4,2013-01-01,25,108701,1.0,NaN,Holiday,National,Ecuador,Primer dia del ano,False
...,...,...,...,...,...,...,...,...,...,...,...
95,95,2013-01-01,25,268664,2.0,NaN,Holiday,National,Ecuador,Primer dia del ano,False
96,96,2013-01-01,25,268676,3.0,NaN,Holiday,National,Ecuador,Primer dia del ano,False
97,97,2013-01-01,25,268834,2.0,NaN,Holiday,National,Ecuador,Primer dia del ano,False
98,98,2013-01-01,25,273528,2.0,NaN,Holiday,National,Ecuador,Primer dia del ano,False
99,99,2013-01-01,25,275823,1.0,NaN,Holiday,National,Ecuador,Primer dia del ano,False

In [16]:
df['store_nbr'].unique()

array([25,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16,
       17, 18, 19, 23, 24, 26, 27, 28, 30, 31, 32, 33, 34, 35, 37, 38, 39,
       40, 41, 43, 44, 45, 46, 47, 48, 49, 50, 51, 54, 36, 53, 20, 29, 21,
       42, 22, 52], dtype=int64)

In [17]:
df.head()

   id        date  store_nbr  item_nbr  unit_sales onpromotion
0   0  2013-01-01         25    103665         7.0         NaN
1   1  2013-01-01         25    105574         1.0         NaN
2   2  2013-01-01         25    105575         2.0         NaN
3   3  2013-01-01         25    108079         1.0         NaN
4   4  2013-01-01         25    108701         1.0         NaN

In [20]:
# mozda treba da se doda da se spaja preko godine i meseca
# ovo mu je preveliki join da radi izgleda, mora nekako drugacije da se smisli resenje
df_st_13 = df_st_13.merge(df_holidays, on='date', how='left')
df_st_13.head()

,id,date,store_nbr,item_nbr,unit_sales,onpromotion,type_x,locale_x,locale_name_x,description_x,transferred_x,type_y,locale_y,locale_name_y,description_y,transferred_y
0,12764,2013-01-02,13,103501,13.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,12765,2013-01-02,13,105576,23.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,12766,2013-01-02,13,106716,11.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,12767,2013-01-02,13,108079,1.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,12768,2013-01-02,13,108701,4.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [21]:
df_st_13 = df_st_13.merge(df_oil, on='date', how='left')
df_st_13.head()

,id,date,store_nbr,item_nbr,unit_sales,onpromotion,type_x,locale_x,locale_name_x,description_x,transferred_x,type_y,locale_y,locale_name_y,description_y,transferred_y,dcoilwtico
0,12764,2013-01-02,13,103501,13.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,93.14
1,12765,2013-01-02,13,105576,23.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,93.14
2,12766,2013-01-02,13,106716,11.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,93.14
3,12767,2013-01-02,13,108079,1.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,93.14
4,12768,2013-01-02,13,108701,4.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,93.14

In [23]:
df_st_13 = df_st_13.merge(df_stores, on='store_nbr', how='left')
# df_st_13 store_nbr
# df_stores store_number
df_st_13.head()

,id,date,store_nbr,item_nbr,unit_sales,onpromotion,type_x,locale_x,locale_name_x,description_x,...,type_y,locale_y,locale_name_y,description_y,transferred_y,dcoilwtico,city,state,type,cluster
0,12764,2013-01-02,13,103501,13.0,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,93.14,Latacunga,Cotopaxi,C,15
1,12765,2013-01-02,13,105576,23.0,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,93.14,Latacunga,Cotopaxi,C,15
2,12766,2013-01-02,13,106716,11.0,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,93.14,Latacunga,Cotopaxi,C,15
3,12767,2013-01-02,13,108079,1.0,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,93.14,Latacunga,Cotopaxi,C,15
4,12768,2013-01-02,13,108701,4.0,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,93.14,Latacunga,Cotopaxi,C,15

In [24]:
df_st_13 = df_st_13.merge(df_items, on='item_nbr', how='left')
df_st_13.head()

,id,date,store_nbr,item_nbr,unit_sales,onpromotion,type_x,locale_x,locale_name_x,description_x,...,description_y,transferred_y,dcoilwtico,city,state,type,cluster,family,class,perishable
0,12764,2013-01-02,13,103501,13.0,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,93.14,Latacunga,Cotopaxi,C,15,CLEANING,3008,0
1,12765,2013-01-02,13,105576,23.0,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,93.14,Latacunga,Cotopaxi,C,15,GROCERY I,1045,0
2,12766,2013-01-02,13,106716,11.0,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,93.14,Latacunga,Cotopaxi,C,15,GROCERY I,1032,0
3,12767,2013-01-02,13,108079,1.0,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,93.14,Latacunga,Cotopaxi,C,15,GROCERY I,1030,0
4,12768,2013-01-02,13,108701,4.0,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,93.14,Latacunga,Cotopaxi,C,15,DELI,2644,1

In [26]:
df_st_13 = df_st_13.merge(df_transactions, on=['store_nbr', 'date'], how='left')
df_st_13

c:\Users\Dell\anaconda3\Lib\site-packages\IPython\lib\pretty.py:778: FutureWarning: In a future version, object-dtype columns with all-bool values will not be included in reductions with bool_only=True. Explicitly cast to bool dtype instead.
  output = repr(obj)
c:\Users\Dell\anaconda3\Lib\site-packages\IPython\core\formatters.py:344: FutureWarning: In a future version, object-dtype columns with all-bool values will not be included in reductions with bool_only=True. Explicitly cast to bool dtype instead.
  return method()

,id,date,store_nbr,item_nbr,unit_sales,onpromotion,type_x,locale_x,locale_name_x,description_x,...,transferred_y,dcoilwtico,city,state,type,cluster,family,class,perishable,transactions
0,12764,2013-01-02,13,103501,13.0,NaN,NaN,NaN,NaN,NaN,...,NaN,93.14,Latacunga,Cotopaxi,C,15,CLEANING,3008,0,1102.0
1,12765,2013-01-02,13,105576,23.0,NaN,NaN,NaN,NaN,NaN,...,NaN,93.14,Latacunga,Cotopaxi,C,15,GROCERY I,1045,0,1102.0
2,12766,2013-01-02,13,106716,11.0,NaN,NaN,NaN,NaN,NaN,...,NaN,93.14,Latacunga,Cotopaxi,C,15,GROCERY I,1032,0,1102.0
3,12767,2013-01-02,13,108079,1.0,NaN,NaN,NaN,NaN,NaN,...,NaN,93.14,Latacunga,Cotopaxi,C,15,GROCERY I,1030,0,1102.0
4,12768,2013-01-02,13,108701,4.0,NaN,NaN,NaN,NaN,NaN,...,NaN,93.14,Latacunga,Cotopaxi,C,15,DELI,2644,1,1102.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1850547,125420091,2017-08-15,13,2106464,1.0,True,Holiday,Local,Riobamba,Fundacion de Riobamba,...,False,47.57,Latacunga,Cotopaxi,C,15,BEVERAGES,1148,0,842.0
1850548,125420092,2017-08-15,13,2108569,1.0,False,Holiday,Local,Riobamba,Fundacion de Riobamba,...,False,47.57,Latacunga,Cotopaxi,C,15,GROCERY I,1086,0,842.0
1850549,125420093,2017-08-15,13,2110456,2.0,False,Holiday,Local,Riobamba,Fundacion de Riobamba,...,False,47.57,Latacunga,Cotopaxi,C,15,BEVERAGES,1120,0,842.0
1850550,125420094,2017-08-15,13,2116416,6.0,False,Holiday,Local,Riobamba,Fundacion de Riobamba,...,False,47.57,Latacunga,Cotopaxi,C,15,GROCERY I,1060,0,842.0
1850551,125420095,2017-08-15,13,2122188,1.0,False,Holiday,Local,Riobamba,Fundacion de Riobamba,...,False,47.57,Latacunga,Cotopaxi,C,15,GROCERY I,1084,0,842.0

In [ ]:
df.dtypes

id               int64
date            object
store_nbr        int64
item_nbr         int64
unit_sales     float64
onpromotion     object
dtype: object